Tekla Open API Reference for Tekla Structures 2025
AutoDrawingsStatusEnum Enumeration
 The status of the AutoDrawing script execution.
 Namespace: Tekla.Structures.Drawing.Automation
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AutoDrawingsStatusEnum
Public Enumeration AutoDrawingsStatusEnum
Members
Member name | Value | Description
OPERATION_OK | 0 |  The AutoDrawing script was executed without errors.
OPERATION_FAILED | 1 |  An error occured during the AutoDrawing script execution. See the AutoDrawing log file for more details.
ERROR_NUMBERING_NOT_UPTODATE | 2 |  The AutoDrawing script could not be executed because the numbering was not up-to-date.
ERROR_DRAWING_EDITOR_MUST_BE_CLOSED | 3 |  The command could not be executed because a drawing was open. Close the drawing and try again.
See Also
Reference
Tekla.Structures.Drawing.Automation Namespace